fn main() {
    let n: i32 = 7;             // Кількість точок [cite: 65]
    let a: f32 = 0.0;           // Початок інтервалу [cite: 66]
    let b: f32 = 3.1415926;     // Кінець інтервалу (пі) [cite: 67]
    
    // Розрахунок кроку табулювання з приведенням типів [cite: 6, 68]
    let h: f32 = (b - a) / ((n - 1) as f32);
    
    let mut x: f32; 
    let mut fx: f32;

    println!(" i |    x     |   sin(x)");
    println!("-------------------------");

    for i in 1..n + 1 {
        // Формула для x_i з приведенням i до f32 [cite: 71]
        x = a + ((i - 1) as f32) * h;
        fx = x.sin(); // Обчислення синуса 
        
        // Вивід результатів [cite: 73]
        println!("{:2} | {:8.5} | {:8.5}", i, x, fx);
    }
}